app/views/symptoms/index.html.erb

            symptom_order.each_with_index do |symptom_name, index|
              symptom = Symptom.find_by(name: symptom_name)
---
SELECT "symptoms".* FROM "symptoms" WHERE "symptoms"."name" = '腰痛' LIMIT 1