app/views/favorites/index.html.erb

              <% @favorites.each do |favorite| %>
                <% if favorite.exercise.present? %>
---
SELECT "exercises".* FROM "exercises" WHERE "exercises"."id" IN (3, 4)

                        <div class="d-flex justify-content-between align-items-start mb-2">
                          <% if favorite.exercise.symptom.present? %>
---
SELECT "symptoms".* FROM "symptoms" WHERE "symptoms"."id" = 4 LIMIT 1