app/controllers/exercises_controller.rb

SELECT "exercises".* FROM "exercises" ORDER BY "exercises"."created_at" DESC
---
  def index
    @exercises = Exercise.all.order(created_at: :desc)

SELECT "symptoms".* FROM "symptoms"
---
  def new
    @exercise = Exercise.new
    @symptoms = Symptom.all

INSERT INTO "exercises" ("title", "description", "steps", "duration", "symptom_id", "created_at", "updated_at", "youtube_url", "instructions", "category", "item_type", "published") VALUES ('腰痛改善', '腰痛を和らげるための簡単なストレッチ', '', 10, 4, '2025-10-19 11:45:04.716146', '2025-10-19 11:45:04.716146', 'https://www.youtube.com/watch?v=o9pKWG9XjxU', '', NULL, 0, TRUE) RETURNING "id"
SELECT "symptoms".* FROM "symptoms"
---
  def create
    @exercise = Exercise.new(exercise_params)

    if @exercise.save
      flash[:success] = "エクササイズを作成しました"
      redirect_to @exercise
    else
      @symptoms = Symptom.all

SELECT "symptoms".* FROM "symptoms"
---
  def edit
    @symptoms = Symptom.all

SELECT "exercises".* FROM "exercises" WHERE "exercises"."id" = 3 LIMIT 1
---
  def set_exercise
    @exercise = Exercise.find(params[:id])