app/controllers/exercises_controller.rb

  def index
    @exercises = Exercise.all
---
SELECT "exercises".* FROM "exercises"

  def set_exercise
    @exercise = Exercise.find(params[:id])
---
SELECT "exercises".* FROM "exercises" WHERE "exercises"."id" = 3 LIMIT 1