app/controllers/favorites_controller.rb

SELECT "exercises".* FROM "exercises" WHERE "exercises"."id" IN (3, 4)
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = 1 ORDER BY "favorites"."created_at" DESC
---
  def index
    @favorites = current_user.favorites.includes(:exercise => :symptom)

SELECT "exercises".* FROM "exercises" WHERE "exercises"."id" = 3 LIMIT 1
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = 1 AND "favorites"."exercise_id" = 3 LIMIT 1
---
  def create
    @exercise = Exercise.find(params[:exercise_id])
    @favorite = current_user.favorites.find_or_initialize_by(exercise: @exercise)

SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = 1 AND "favorites"."id" = 1 LIMIT 1
---
  def set_favorite
    @favorite = current_user.favorites.find(params[:id])