app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = '' LIMIT 1
---
  def dev_login
    return redirect_to login_path, alert: "この機能は開発環境でのみ利用可能です" unless Rails.env.development?

    user = User.find_or_create_by!(email: params[:role] == "admin" ? "admin@example.com" : "user@example.com") do |u|