app/controllers/symptoms_controller.rb

SELECT "symptoms".* FROM "symptoms" WHERE "symptoms"."name" = '腰痛' LIMIT 1
---
  def index
    @symptoms = Symptom.all.order(:name)

SELECT "symptoms".* FROM "symptoms" WHERE "symptoms"."id" = 4 LIMIT 1
---
  def set_symptom
    @symptom = Symptom.find(params[:id])