app/controllers/symptoms_controller.rb

  def show
    @symptom = Symptom.find(params[:id])
---
SELECT "symptoms".* FROM "symptoms" WHERE "symptoms"."id" = 1 LIMIT 1