app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ('wataru', 'wataru1983_118@yahoo.co.jp', '$2a$12$Vw2r8h4IPI5Gzc/ucRr6E.JFooEJ/B1FscQpuz3dxBKwORcUbXtWW', '2025-10-03 13:34:00.108175', '2025-10-03 13:34:00.108175') RETURNING "id"

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "updated_at" = '2025-10-14 13:52:48.863462', "gender" = '', "primary_symptom" = '' WHERE "users"."id" = 1