app/models/user.rb

  def add_favorite(exercise)
    return false unless exercise
    favorites.find_or_create_by(exercise: exercise)
---
INSERT INTO "favorites" ("user_id", "exercise_id", "created_at", "updated_at", "memo", "rating", "personal_notes") VALUES (1, 4, '2025-10-19 11:48:05.082500', '2025-10-19 11:48:05.082500', NULL, NULL, NULL) RETURNING "id"