app/views/exercises/show.html.erb

SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = 4 AND "favorites"."exercise_id" = 3 LIMIT 1
---
          <% if current_user %>
            <% favorite = current_user.favorites.find_by(exercise: @exercise) %>